app/views/messages/create.json.jbuilder

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('r', '6.jpg', 1, 2, '2019-02-17 09:24:39', '2019-02-17 09:24:39')
---
json.user_name  @message.user.name
json.date  @message.created_at.strftime('%Y/%m/%d %H:%M:%S')