app/views/messages/index.html.haml

SELECT `groups`.* FROM `groups` INNER JOIN `user_groups` ON `groups`.`id` = `user_groups`.`group_id` WHERE `user_groups`.`user_id` = 2
---
      .group
        - current_user.groups.each do |group|