app/views/groups/edit.html.haml

SELECT `users`.* FROM `users`
---
          .chat-group-user.clearfix
            = f.collection_check_boxes :user_ids, User.all, :id, :name