app/views/groups/index.html.haml

    .groups
      - current_user.groups.each do |group|
---
SELECT `groups`.* FROM `groups` INNER JOIN `user_groups` ON `groups`.`id` = `user_groups`.`group_id` WHERE `user_groups`.`user_id` = 1