app/views/groups/new.html.haml

SELECT `users`.* FROM `users`
---
          %input{name: "chat_group[user_ids][]", type: "hidden", value: current_user.id}/
          -# = t.collection_check_boxes :user_ids, User.all, :id, :name