app/controllers/groups_controller.rb

UPDATE `groups` SET `name` = 'gagagag', `updated_at` = '2019-02-11 12:38:04' WHERE `groups`.`id` = 3
---
  def update
    if @group.update(group_params)

INSERT INTO `user_groups` (`user_id`, `created_at`, `updated_at`) VALUES (2, '2019-02-11 10:07:03', '2019-02-11 10:07:03')
---
  def create
    @group = Group.new(group_params)
    @group.users << current_user

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1
---
  def set_groups
    @group = Group.find(params[:id])