app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (3, 2)
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
    respond_to do |format|
      format.html
      format.json { @new_messages = @messages.where('id > ?', params[:id]) }

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('わーお', '5.jpg', 4, 2, '2019-02-13 03:50:22', '2019-02-13 03:50:22')
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `user_groups` ON `users`.`id` = `user_groups`.`user_id` WHERE `user_groups`.`group_id` = 7
---
  def create
    @message = @group.messages.new(message_params)
    if @message.save
      respond_to do |format|
      format.html { redirect_to group_messages_path(@group), notice: 'メッセージが送信されました' }
      format.json
      end
    else
      @messages = @group.messages.includes(:user)