app/controllers/users_controller.rb

def update
  if current_user.update(user_params)
---
UPDATE `users` SET `name` = '', `updated_at` = '2019-02-13 09:21:21' WHERE `users`.`id` = 2